app/commands/authenticate_user.rb

SELECT `permissions`.`id`, `permissions`.`title` FROM `permissions` INNER JOIN `permissions_profiles` ON `permissions`.`id` = `permissions_profiles`.`permission_id` WHERE `permissions_profiles`.`profile_id` = 1
---
    def call
        if user
            _profile_with_permissions = user.attributes.except('password_digest', 'auth_token', 'profile_id').as_json
            _profile_with_permissions['role'] = user.profile.attributes.slice('id', 'title').as_json

            _permissions = []
            user.profile.permissions.select(:id, :title).each do |p|

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'lacythiel@konopelski.org' LIMIT 1
---
    def user
        user = User.find_by_email(email)