app/controllers/api/v1/permissions_controller.rb

  def index
    @permissions = Permission.all
---
SELECT `permissions`.* FROM `permissions`