app/controllers/api/v1/profiles_controller.rb

  def index
    @profiles = Profile.all
---
SELECT permissions.title, permissions.description FROM `profiles`

  def create
    @profile = Profile.new(profile_params)

    if @profile.save
---
INSERT INTO `profiles` (`title`, `description`, `created_at`, `updated_at`) VALUES ('postedProfile1', 'TESTE DE POST', '2019-05-26 05:22:39', '2019-05-26 05:22:39')

  def update
    if @profile.update(profile_params)
---
UPDATE `profiles` SET `title` = 'editeddProfile1', `updated_at` = '2019-05-26 05:45:44' WHERE `profiles`.`id` = 20

    def set_profile
      @profile = Profile.find(params[:id])
---
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 19 LIMIT 1